<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">

<HTML>
<HEAD>
<TITLE>Details_Fonct</TITLE>
<META NAME="Author" CONTENT="Annick Druel">
<META NAME="Generator" CONTENT="NetObjects Fusion Personal Edition for Windows">

</HEAD>

<BODY BGCOLOR="#FFFFFF" LINK="#FF8040" VLINK="#808080" TEXT="#000000">
<TABLE CELLPADDING=0 CELLSPACING=0 BORDER=0 WIDTH=640>
<TR VALIGN="top" ALIGN="left">
<TD>

  <TABLE BORDER=0 CELLSPACING=0 CELLPADDING=0 WIDTH=106>
   <TR VALIGN="top" ALIGN="left">
	<TD WIDTH=106 HEIGHT =82><IMG SRC="../assets/auto_generated_images/img_3e99e161.gif" WIDTH =106 HEIGHT =1 BORDER=0></TD>
   </TR>
   <TR VALIGN="top" ALIGN="left">
	<TD WIDTH=106 HEIGHT =380>
	  <TABLE BORDER=0 CELLSPACING=0 CELLPADDING=3 >
	 <TR VALIGN="top" ALIGN="left">
		<TD WIDTH=100 HEIGHT=70><A HREF="../default.htm"><IMG HEIGHT=70 WIDTH=100 SRC="../assets/auto_generated_images/img_25760253.gif"  BORDER=0  ALT=" TeraVue " ></A></TD>
	 </TR>
	 <TR VALIGN="top" ALIGN="left">
		<TD WIDTH=100 HEIGHT=70><A HREF="../html/nouveaut_s.htm"><IMG HEIGHT=70 WIDTH=100 SRC="../assets/auto_generated_images/img_4388dc04.gif"  BORDER=0  ALT=" Nouveautés " ></A></TD>
	 </TR>
	 <TR VALIGN="top" ALIGN="left">
		<TD WIDTH=100 HEIGHT=70><A HREF="../html/support.htm"><IMG HEIGHT=70 WIDTH=100 SRC="../assets/auto_generated_images/img_25cb9d69.gif"  BORDER=0  ALT=" Support " ></A></TD>
	 </TR>
	 <TR VALIGN="top" ALIGN="left">
		<TD WIDTH=100 HEIGHT=70><A HREF="../html/eb.htm"><IMG HEIGHT=70 WIDTH=100 SRC="../assets/auto_generated_images/img_263bea60.gif"  BORDER=0  ALT=" Produits " ></A></TD>
	 </TR>
	 <TR VALIGN="top" ALIGN="left">
		<TD WIDTH=100 HEIGHT=70><A HREF="../html/fonctions.htm"><IMG HEIGHT=70 WIDTH=100 SRC="../assets/auto_generated_images/img_3e889ed2.gif"  BORDER=0  ALT=" Fonctions " ></A></TD>
	 </TR>
	  </TABLE></TD>
   </TR>
   <TR VALIGN="top" ALIGN="left">
	<TD HEIGHT =4862></TD>
   </TR>
  </TABLE>
</TD>
<TD>

  <TABLE BORDER=0 CELLSPACING=0 CELLPADDING=0 WIDTH=534>
   <TR VALIGN="top" ALIGN="left">
	<TD WIDTH=6 HEIGHT =11><IMG SRC="../assets/auto_generated_images/img_3e99e161.gif" WIDTH =6 HEIGHT =1 BORDER=0></TD>
	<TD WIDTH=380><IMG SRC="../assets/auto_generated_images/img_3e99e161.gif" WIDTH =380 HEIGHT =1 BORDER=0></TD>
	<TD WIDTH=148><IMG SRC="../assets/auto_generated_images/img_3e99e161.gif" WIDTH =148 HEIGHT =1 BORDER=0></TD>
   </TR>
   <TR VALIGN="top" ALIGN="left">
	<TD HEIGHT =70></TD>
	<TD WIDTH=380><IMG HEIGHT=70 WIDTH=380 SRC="../assets/auto_generated_images/img_41382174.gif"  BORDER=0  ALT=" Details_Fonctions " ></TD>
	<TD></TD>
   </TR>
  </TABLE>

  <TABLE BORDER=0 CELLSPACING=0 CELLPADDING=0 WIDTH=534>
   <TR VALIGN="top" ALIGN="left">
	<TD WIDTH=4><IMG SRC="../assets/auto_generated_images/img_3e99e161.gif" WIDTH =4 HEIGHT =1 BORDER=0></TD>
	<TD WIDTH=505><P><A NAME="Gestion_TeraFonct"></A><B><FONT SIZE="+1">1. <U>Gestion, affichage, &eacute;dition</B></FONT></U></P><P><B>Gestion des donn&eacute;es image et plans d’information correspondants (canal)</B>
<UL TYPE="DISC"><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Les fichiers de donn&eacute;es image sont accessibles sur tout type de support disque dur, disquette et CD-ROM. Le support physique est param&eacute;tr&eacute; au niveau du nom d’image en utilisant le pr&eacute;fixe d’unit&eacute; des fichiers DOS (ex : C:LANDSAT).</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Liste des noms d’image.</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Cr&eacute;ation d’une image.</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Affichage du descriptif complet du contenu d’une image et de ses param&egrave;tres.</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Acc&egrave;s aux param&egrave;tres de description d’une image : texte d’information et titre de l’image, descriptif des canaux, choix de la fen&ecirc;tre de visualisation.</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Gestion des canaux constitutifs d’une image multispectrale ou multith&eacute;matique comprenant les fonctions de cr&eacute;ation ou de destruction de lien ainsi qu’une possibilit&eacute; de &laquo;purge&raquo; du fichier canal.</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Calcul et visualisation graphique ou tabul&eacute;e des histogrammes par canal.</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Sp&eacute;cification interactive d’une table de contraste pour chaque canal, calcul de fonctions de transfert standard par canal (ex : lin&eacute;aire ou isopopulation) pour modification du contraste &agrave; l’affichage. Cr&eacute;ation de table de recodage apr&egrave;s classification.</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Manipulation/stockage d’une table couleur sp&eacute;cifique par canal.</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Taille maximale de l’image : 32767 x 32767 pixels.</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Sauvegarde des canaux en BMP, des graphiques en WMF, des textes en ASCII.</FONT><FONT COLOR="#000000" SIZE="+1"> </FONT></LI>
</UL><P><B>Gestion int&eacute;gr&eacute;e des tables couleur</B></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">L’utilisateur peut g&eacute;rer un fichier de 96 tables couleur permettant d’associer une couleur de son choix &agrave; la valeur de chaque pixel d’un canal.</FONT>
<UL TYPE="DISC"><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Liste des noms des tables couleur.</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Changement du nom d’une table.</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">D&eacute;placement par recopie d’une table.</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Destruction d’une table couleur.</FONT></LI>
</UL><P><B>Gestion des tables de descripteurs</B></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">La valeur de chaque pixel d’un canal peut &ecirc;tre associ&eacute;e &agrave; un descripteur de contenu sous forme d’un texte de 256 caract&egrave;res. L’utilisateur peut g&eacute;rer la table des descripteurs correspondant &agrave; chaque canal.</FONT>
<UL TYPE="DISC"><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Liste des descripteurs.</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Association d’un texte descriptif &agrave; une valeur de pixel choisie par l’utilisateur.</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Modification de chaque texte descriptif et de sa couleur.</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Affichage d’une l&eacute;gende color&eacute;e.</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Comptages par code et mise &agrave; jour.</FONT></LI>
</UL><P><B>Affichage d’un canal d’une image</B></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">La visualisation sur l’&eacute;cran correspond &agrave; l’affichage d’un canal apr&egrave;s choix de la fen&ecirc;tre de visualisation de l’image et de la table couleur associ&eacute;e au canal. Diverses options permettent d’aider &agrave; la r&eacute;p&eacute;tition ou &agrave; la modification des t&acirc;ches d’affichage.</FONT>
<UL TYPE="DISC"><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Affichage de l’&eacute;cran couleur courant jusqu’&agrave; 4096x4096 pixels.</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Changement de table couleur pour un m&ecirc;me canal.</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Changement de canal pour une image donn&eacute;e.</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Changement d’image.</FONT></LI>
</UL><P><B>Manipulation interactive de la visualisation sur &eacute;cran</B></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Une fois l’affichage r&eacute;alis&eacute; sur l’&eacute;cran couleur, la visualisation peut &ecirc;tre manipul&eacute;e en mode interactif par l’interm&eacute;diaire d’un curseur dont le d&eacute;placement est coupl&eacute; &agrave; celui d’une souris ou du croisillon d’une tablette graphique. Ces manipulations concernent la modification de la g&eacute;om&eacute;trie de visualisation et celle des couleurs affect&eacute;es &agrave; la valeur de chaque pixel. Certaines fonctions sont r&eacute;serv&eacute;es &agrave; la consultation interactive des images multispectrales : exploration trichrome.</FONT>
<UL TYPE="DISC"><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Rep&eacute;rage et modification de la g&eacute;om&eacute;trie de la visualisation : s&eacute;lection d’un pixel et consultation de sa valeur, de ses coordonn&eacute;es, de sa couleur et de son descriptif ; choix d’une zone &agrave; agrandir (zoom).</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Modification interactive de la couleur affect&eacute;e &agrave; une valeur particuli&egrave;re de pixel : la couleur est modifi&eacute;e en se d&eacute;pla&ccedil;ant dans une palette de 216 couleurs de base selon le choix de la couleur par son contenu RVB (Rouge, Vert, Bleu) ou&nbsp; son contenu TSI (Teinte, Saturation, Intensit&eacute;).</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Fonctions particuli&egrave;res &agrave; la modification des couleurs d’un canal simple :</FONT></LI><P><I><FONT SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">- modification interactive du contraste avec affichage superpos&eacute; &agrave; l’image de l’histogramme du canal visualis&eacute;,</I></FONT></P><P><I><FONT SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">- modification interactive de la table couleur affect&eacute;e &agrave; l’ensemble des valeurs des pixels d’un canal (ex : transport d’une couleur, &eacute;pandage, interpolation entre deux couleurs).</I></FONT></P><P>&nbsp;<LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Fonctions particuli&egrave;res &agrave; la modification des couleurs d’une combinaison multispectrale (Proc&eacute;d&eacute; Krosscolor) : les manipulations correspondent &agrave; la logique du contraste bicanal Krosscolor avec, entre autres, affichage canal par canal, somme et diff&eacute;rence des deux canaux et choix d’une des gammes Krosscolor.</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Fonction de seuillage interactif &agrave; l’&eacute;cran afin de faire ressortir un (ou des) th&egrave;me particulier.</FONT></LI>
</UL><P><A NAME="Combi_TeraFonct"></A><B><FONT SIZE="+1">2. <U>Combinaisons entre canaux</B></FONT></U></P><P><B>Combinaison arithm&eacute;tique entre canaux</B></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Certains traitements demandent avant d’&ecirc;tre appliqu&eacute;s de proc&eacute;der &agrave; une combinaison entre plusieurs canaux selon une formule arithm&eacute;tique. L’utilisateur choisit le nombre et les canaux &agrave; combiner ainsi que la formule de combinaison qu’il peut soumettre en une seule fois, quelle que soit sa complexit&eacute; :</FONT></P>
<UL><P><I><FONT SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Ex :&nbsp;&nbsp; (CAN 3 X CAN 4) / LOG (CAN 8 )</I></FONT></P>
</UL><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Les op&eacute;rations pouvant &ecirc;tre combin&eacute;es sont :</FONT>
<UL TYPE="DISC"><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">les op&eacute;rateurs arithm&eacute;tiques de base : +, -, x, / et exposant</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">les fonctions analytiques simples : LN, EXP, ABS, SQR, SQRT</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">les fonctions de contraste : TAB, PROB, CLA</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">les fonctions couleur : ROUGE, VERT, BLEU, TEIN, SAT, INT</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">les fonctions factorielles : FAC1, FAC2, FAC3</FONT></LI>
</UL><P><B>Combinaison avec masquage logique entre canaux</B></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Un zonage th&eacute;matique est effectu&eacute; par ma s&eacute;lection des pixels correspondants selon des crit&egrave;res logiques. Le traitement est diff&eacute;renci&eacute; suivant le r&eacute;sultat du crit&egrave;re est vrai ou faux. Masquage d’une zone dans une combinaison color&eacute;e.</FONT></P><P><B>Combinaison bicanal (Krosscolor)</B></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Un certain nombre d’algorithmes de visualisation ou de classifications multispectrales utilisent un mode de combinaison bicanal.</FONT></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Apr&egrave;s avoir effectu&eacute; le choix d’une table de contraste (ex : manuelle, lin&eacute;aire ou isopopulation) pour chacun des canaux &agrave; traiter, cette fonction cr&eacute;e un canal combin&eacute;, adapt&eacute; &agrave; la gamme de couleur Krosscolor ou &agrave; ses d&eacute;riv&eacute;s (ex : table couleur de classification Bayes).</FONT></P><P><B>Combinaison tricanal (trichromie)</B></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Deux types d’application peuvent conduire &agrave; l’utilisation d’une combinaison entre trois canaux. En t&eacute;l&eacute;d&eacute;tection, on peut d&eacute;sirer faire une combinaison color&eacute;e de trois bandes spectrales (ex : SPOT,&nbsp; Photos a&eacute;riennes). En reproduction color&eacute;e, on peut synth&eacute;tiser une visualisation en couleur correspondant &agrave; l’image saisie &agrave; l’aide d’une cam&eacute;ra ou d’un scanner.</FONT></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Dans les deux cas, apr&egrave;s avoir effectu&eacute; le choix d’une table de contraste pour chacun des trois canaux, le programme cr&eacute;e un canal combin&eacute; utilisant 216 couleurs fixes (mode vraie couleur) ou r&eacute;sultant d’une affectation optimis&eacute;e de 216 couleurs (mode Tric. Opt.).</FONT></P><P><A NAME="Import_TeraFonct"></A><B><FONT SIZE="+1">3. <U>Importation/Exportation de donn&eacute;es</B></FONT></U></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">TeraVue permet le traitement direct des donn&eacute;es cod&eacute;es sur un octet (8 bits) selon un format&nbsp; BIP (Band Interleaved by Pixel), B I L (Band Interleaved by Line) ou B S Q ( Band Sequential). Ceci permet d’acc&eacute;der &agrave; la quasi-totalit&eacute; des donn&eacute;es satellites (LANDSAT, TM, SPOT, ERS1, AVHRR, METEOSAT) produites par EOSAT, ESA, SPOTIMAGE, ERDAS, ARCINFO, IDRIDI, Titus. Ces donn&eacute;es peuvent &ecirc;tre directement g&eacute;r&eacute;es par CD-ROM. </FONT></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">D’autre part, l’importation/exportation aux formats BMP 8 bits &amp; 4 bits, GIF, JPG, TGA, TIF et DXF permet de communiquer avec les autres logiciels sous Windows. Les fichiers DXF sont interpr&eacute;t&eacute;s en multicouches de trac&eacute;s graphiques et de texte. Chaque couche peut &ecirc;tre visualis&eacute;e de mani&egrave;re ind&eacute;pendante.</FONT></P><P><A NAME="Filtrage_TeraFonct"></A><B><FONT SIZE="+1">4. <U>Filtrage, morphologie math&eacute;matique</B></FONT></U></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Les traitements de type filtrage ou lissage sur les donn&eacute;es r&eacute;pondent &agrave; certains objectifs comme :</FONT>
<UL TYPE="DISC"><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">l’&eacute;limination d’un bruit de mesure par filtrage m&eacute;dian ou conditionnel.</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">la s&eacute;paration des composantes basse fr&eacute;quence et haute fr&eacute;quence d’un canal par lissage.</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">l’am&eacute;lioration du contraste local par filtrage conditionnel.</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">l’extraction de contours par un filtre de type Sobel.</FONT></LI>
</UL><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">L’utilisateur peut effectuer ce type de traitement sur un canal choisi et stocker le r&eacute;sultat dans un autre canal de la m&ecirc;me image. Le calcul s’effectue sur un voisinage carr&eacute; 3x3 centr&eacute; sur le pixel de calcul.</FONT></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">La m&eacute;thode de filtrage peut &ecirc;tre choisie parmi les suivantes : moyenne arithm&eacute;tique, valeur m&eacute;diane, valeur modale, convolution par une fonction de pond&eacute;ration choisie pour chacun des pixels du voisinage glissant suivie d’une compensation lin&eacute;aire de contraste, morphologie math&eacute;matique (&eacute;rosion, dilatation, g&eacute;n&eacute;ration de canal de distance calcul&eacute; &agrave; partir des bords d’objet vers l’int&eacute;rieur et l’ext&eacute;rieur).</FONT></P><P><A NAME="Supervised_TeraFonct"></A><B><FONT SIZE="+1">5. <U>Classification multispectrale supervis&eacute;e</B></FONT></U></P><P><B>Saisie des polygones d’apprentissage</B></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Pour conduire une classification multispectrale en mode supervis&eacute;, l’utilisateur peut choisir des zones d’apprentissage sous forme de polygones saisis sur l’&eacute;cran &agrave; l’aide de la souris et dont il veut individualiser les propri&eacute;t&eacute;s spectrales.</FONT></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">La saisie est limit&eacute;e &agrave; 32 classes par image. Les polygones correspondants sont stock&eacute;s dans un canal sp&eacute;cialis&eacute; o&ugrave; chaque code de polygone est associ&eacute; &agrave; un descripteur dont on peut modifier la couleur et le texte.</FONT></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Le rep&eacute;rage des polygones sur l’&eacute;cran se fait &agrave; l’aide du curseur en explorant la visualisation au facteur d’agrandissement choisi. Le programme permet la num&eacute;risation et la sauvegarde de polygones de forme quelconque, disjoints ou imbriqu&eacute;s.</FONT></P><P><B>Classification interactive bicanal</B></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Celle-ci est bas&eacute;e sur le proc&eacute;d&eacute; Krosscolor et se d&eacute;roule en deux phases : calcul des caract&eacute;ristiques spectrales de chaque zone d’apprentissage suivie d’une classification de chaque pixel de l’image utilisant une m&eacute;thode au maximum de vraisemblance.</FONT></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Dans une premi&egrave;re op&eacute;ration, le programme calcule pour chacun des polygones d’apprentissage contenus dans le canal dit de &laquo;v&eacute;rit&eacute;-terrain&raquo;, l’histogramme crois&eacute; dans les deux canaux (ou bandes spectrales) choisis et le taux de s&eacute;parabilit&eacute; entre les classes.</FONT></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Le r&eacute;sultat de cette affectation (ou classification) peut &ecirc;tre affich&eacute; sous forme d’une carte color&eacute;e en choisissant une table couleur appropri&eacute;e. Apr&egrave;s affichage, l’utilisateur peut modifier &agrave; volont&eacute; la couleur de chaque classe et le seuil de rejet. Apr&egrave;s classification, l’utilisateur peut juger des taux de confusion.</FONT></P><P><B>Classification interactive tricanal (ex : SPOT)</B></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Ce module utilise une m&eacute;thode d’affectation du type pr&eacute;c&eacute;dent dans le cas o&ugrave; l’on retient trois bandes spectrales dans un codage vraie couleur ou trichromie optimis&eacute;e. Une fonction d’agr&eacute;gation autour de centres mobiles est disponible.</FONT></P><P><B>Restitution d’un canal class&eacute;</B></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Quelle que soit la m&eacute;thode de classification employ&eacute;e, celle-ci aboutit toujours &agrave; une association histogramme multispectral/table d’affectation d&eacute;termin&eacute;e &agrave; partir d’un sous-ensemble de l’image appel&eacute; zone-test. Pour obtenir un nouveau canal dans lequel chaque pixel portera un num&eacute;ro de groupe d&eacute;fini par la table d’affectation, l’utilisateur dispose d’une fonction de restitution qui peut &ecirc;tre appliqu&eacute;e &agrave; l’ensemble de l’image de travail en int&eacute;grant &eacute;ventuellement la l&eacute;gende cr&eacute;&eacute;e pour la zone-test.</FONT></P><P><A NAME="Unsupervised_TeraFonct"></A><B><FONT SIZE="+1">6. <U>Classification en mode non supervis&eacute;</B></FONT></U></P><P><B>Agr&eacute;gation CAH</B></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Dans une premi&egrave;re phase, l’agr&eacute;gation des signatures se pratique sur l’histogramme multispectral. Le r&eacute;sultat de l’agr&eacute;gation est un arbre complet de classification ascendante hi&eacute;rarchique, aux noeuds duquel sont affect&eacute;s un num&eacute;ro de groupe et une couleur.</FONT></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">L’utilisateur a le choix du mode d’organisation des couleurs affect&eacute;es &agrave; chaque groupe, selon leur rang dans la repr&eacute;sentation de l’arbre ou selon la couleur moyenne des signatures spectrales formant chacun des groupes en choisissant un triplet RVB (Rouge, Vert, Bleu) associ&eacute; &agrave; trois canaux parmi ceux utilis&eacute;s.</FONT></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Dans une seconde phase, il proc&egrave;de &agrave; une critique interactive des r&eacute;sultats de la classification en utilisant une visualisation de la combinaison trichrome de trois des canaux trait&eacute;s.</FONT></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Parmi les fonctions propos&eacute;es, il peut interactivement :</FONT>
<UL TYPE="DISC"><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">choisir un seuil de coupure dans l’arbre de classification ascendante hi&eacute;rarchique.</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">d&eacute;tailler les signatures spectrales d’un groupe particulier.</FONT></LI><LI><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">faire appara&icirc;tre les zones non class&eacute;es de l’image.</FONT></LI>
</UL><P><B>Analyse factorielle</B></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Cette fonction permet d’effectuer une analyse de la corr&eacute;lation ou des liaisons entre canaux bruts pour un m&ecirc;me histogramme multispectral.</FONT></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Les deux techniques retenues sont l’analyse en composantes principales et l’analyse factorielle des correspondances. Il en r&eacute;sulte une liste des combinaisons lin&eacute;aires et l’utilisateur manipule de mani&egrave;re interactive toute combinaison color&eacute;e r&eacute;sultant de la combinaison de trois composantes factorielles.</FONT></P><P><A NAME="Rectif_TeraFonct"></A><B><FONT SIZE="+1">7. <U>Rectification g&eacute;om&eacute;trique/Mosa&iuml;que d’image</B></FONT></U></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Il est souvent n&eacute;cessaire de modifier la g&eacute;om&eacute;trie d’une image au cours de la gestion d’une base de donn&eacute;es cartographiques. Ceci se manifeste par la cr&eacute;ation de nouveaux fichiers dans lesquels les donn&eacute;es sont transf&eacute;r&eacute;es apr&egrave;s avoir subi l’une des transformations suivantes : changement d’origine, changement d’&eacute;chelle, modification de la g&eacute;om&eacute;trie des pixels pour les mettre en conformit&eacute; avec une image de g&eacute;om&eacute;trie donn&eacute;e ou un syst&egrave;me de r&eacute;f&eacute;rence cartographique choisi par l’utilisateur.</FONT></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">La rectification permet la constitution directe de mosa&iuml;que d’images jusqu’&agrave; 32767x32767 pixels. Elle peut utiliser une r&eacute;f&eacute;rence &agrave; un syst&egrave;me de coordonn&eacute;es g&eacute;ographiques.</FONT></P><P><B>Transformations g&eacute;om&eacute;triques simples</B></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Les manipulations permettent &agrave; l’utilisateur de copier tout ou partie rectangulaire d’une image en lui faisant subir une translation, une rotation ou un changement d’&eacute;chelle.</FONT></P><P><B>Ajustement g&eacute;om&eacute;trique par amers</B></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Par la s&eacute;lection interactive de points caract&eacute;ristiques (amers) reconnus dans l’image &agrave; rectifier et dans l’image de r&eacute;f&eacute;rence, l’utilisateur construit une loi de transformation g&eacute;om&eacute;trique appel&eacute;e &laquo;mod&egrave;le de d&eacute;formation&raquo; qui est ensuite utilis&eacute;e pour r&eacute;&eacute;chantillonner l’image source. La position des amers dans les deux documents mis en correspondance est lue sur fichier.</FONT></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Le mod&egrave;le de d&eacute;formation utilis&eacute; est, au choix, un polyn&ocirc;me du premier ou du second degr&eacute; dont les coefficients sont d&eacute;termin&eacute;s par une m&eacute;thode de minimisation d’erreur aux moindres carr&eacute;s. L’utilisateur peut alors appr&eacute;cier ou am&eacute;liorer la qualit&eacute; du mod&egrave;le en agissant de mani&egrave;re interactive sur la liste des amers retenus pour le calcul. Apr&egrave;s d&eacute;termination du mod&egrave;le, un dernier module proc&egrave;de &agrave; la cr&eacute;ation d’une nouvelle image rectifi&eacute;e en utilisant une m&eacute;thode de r&eacute;&eacute;chantillonnage au plus proche voisin.</FONT></P><P><B>Relations avec les fichiers DXF</B></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Les fichiers bitmap d’une carte th&eacute;matique peuvent &ecirc;tre convertis au format vectoriel DXF. Il est &eacute;galement possible d’habiller les images affich&eacute;es avec des fichiers DXF dont on peut changer la couleur et l’&eacute;paisseur du trac&eacute;.</FONT></P><P><A NAME="MNT_TeraFonct"></A><B><FONT SIZE="+1">8. <U>Mod&egrave;le num&eacute;rique de terrain. Visualisation 3D</B></FONT></U></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">A partir des fichiers de mod&egrave;le de terrain sur 8 ou 16 bits, TeraVue permet la densification des mod&egrave;les &agrave; partir d’isopleths. Tout canal peut &ecirc;tre superpos&eacute; au MNT et repr&eacute;sent&eacute; en perspective 3D.</FONT></P><P><A NAME="Carto_TeraFonct"></A><B><FONT SIZE="+1">9. <U>Pr&eacute;sentation cartographique </B></FONT></U></P><P><B>Composition cartographique</B></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Les canaux de type carte (r&eacute;sultats de classification) peuvent &ecirc;tre pr&eacute;sent&eacute;s sous forme d’une carte avec l&eacute;gende, &eacute;chelle et cadre. La pr&eacute;sentation peut &ecirc;tre renrichie d’un habillage graphique. cette composition est sauvegard&eacute;e dans le presse-papiers ou sur fichier.</FONT></P><P><B>Planisph&egrave;re. Fonds de carte de g&eacute;olocalisation</B></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">L’utilisateur peut cr&eacute;er ses propres fonds de cartes pour la g&eacute;olocalisation des index d’images. Il utilise un habillage graphique &agrave; toutes &eacute;chelles et selon six syst&egrave;mes de projection diff&eacute;rents. L’habillage graphique peut &ecirc;tre import&eacute; (ex : DCW transform&eacute; en DXF)</FONT><FONT COLOR="#000000" SIZE="+1" FACE="Times New Roman,Times,Times NewRoman">.</FONT></P><P><A NAME="Spectral_TeraFonct"></A><B><FONT SIZE="+1">10. <U>Simulateur spectral</B></FONT></U></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Le logiciel offre la possibilit&eacute; de simuler le r&eacute;sultat combin&eacute; des performances du capteur et des perturbations dues &agrave; l’atmosph&egrave;re pour un objet dont on connait “a priori” la courbe de r&eacute;flectance.</FONT></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Le mod&egrave;le utilis&eacute; fonctionne dans un domaine spectral allant de 0,3 &agrave; 4 microns. L’utilisateur peut utiliser ses propres donn&eacute;es &agrave; condition de respecter l’organisation des fichiers sp&eacute;cifiques &agrave; cette application</FONT><FONT COLOR="#000000" SIZE="+1" FACE="Times New Roman,Times,Times NewRoman">.</FONT></P><P><A NAME="Formation_TeraFonct"></A><B><FONT SIZE="+1">11. <U>Auto-formation &agrave; TeraVue</B></FONT></U></P><P><FONT COLOR="#000000" SIZE="-1" FACE="Times New Roman,Times,Times NewRoman">Le programme a un mode tuteur. Dans ce cas, l’ex&eacute;cution du circuit propos&eacute; est contr&ocirc;l&eacute; pas &agrave; pas. L’utilisateur est contraint de suivre un chemin de traitement pr&eacute;d&eacute;fini. Il est guid&eacute; en permanence par un fichier d’aide sp&eacute;cialis&eacute;.</FONT></P><P>&nbsp;</TD>

	<TD WIDTH=25><IMG SRC="../assets/auto_generated_images/img_3e99e161.gif" WIDTH =25 HEIGHT =1 BORDER=0></TD>
   </TR>
  </TABLE>

  <TABLE BORDER=0 CELLSPACING=0 CELLPADDING=0>
   <TR VALIGN="top" ALIGN="left">
	<TD WIDTH=11 HEIGHT =9><IMG SRC="../assets/auto_generated_images/img_3e99e161.gif" WIDTH =11 HEIGHT =1 BORDER=0></TD>
	<TD WIDTH=363><IMG SRC="../assets/auto_generated_images/img_3e99e161.gif" WIDTH =363 HEIGHT =1 BORDER=0></TD>
	<TD WIDTH=160><IMG SRC="../assets/auto_generated_images/img_3e99e161.gif" WIDTH =160 HEIGHT =1 BORDER=0></TD>
   </TR>
   <TR VALIGN="top" ALIGN="left">
	<TD></TD>
	<TD NOWRAP> [<A HREF="../default.htm">TeraVue</A>]  [<A HREF="../html/nouveaut_s.htm">Nouveautés</A>]  [<A HREF="../html/support.htm">Support</A>]  [<A HREF="../html/eb.htm">Produits</A>]  [<A HREF="../html/fonctions.htm">Fonctions</A>] </TD>
	<TD></TD>
   </TR>
   <TR VALIGN="top" ALIGN="left">
	<TD COLSPAN=3 HEIGHT =72></TD>
   </TR>
  </TABLE>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>
